MoseychukA/FLARM_ALL/Base_Lan_ESP32/FlyRf_Lan_26_03_22_00/CoreCommandBuffer.cpp
                    }
                    else if (!strcmp_P(commandName, SET_GSM)|| !strcmp_P(commandName, SET_GSM_M))              // Установить параметры передачи данных по GSM
                    {
                        if (cParser.argsCount() > 2)
                        {

                            const char* paramPtr = cParser.getArg(3);
                            commandHandled = setTRACKER(commandName, cParser, pStream);
                        }
                        else
                        {
                            // недостаточно параметров
                            commandHandled = printBackSETResult(false, commandName, pStream);
                        }
                    }
                    else if (!strcmp_P(commandName, SET_BT_OK) || !strcmp_P(commandName, SET_BT_OK_M))              // Установить подтверждение прочтения сообщения по GSM
                    {
                        if (cParser.argsCount() > 2)
                        {

                            const char* paramPtr = cParser.getArg(3);
                            commandHandled = setBTOK(commandName, cParser, pStream);
                        }
                        else
                        {
                            // недостаточно параметров
                            commandHandled = printBackSETResult(false, commandName, pStream);
                        }
                    }
                    else if (!strcmp_P(commandName, TEXT_COMMAND) || !strcmp_P(commandName, TEXT_COMMAND_M))              // Установить подтверждение прочтения сообщения по GSM
                    {
                        if (cParser.argsCount() > 2)
                        {
                            const char* paramPtr = cParser.getArg(1);
                            commandHandled = setTXT(commandName, cParser, pStream, textString);
                        }
                        else
                        {
                            // недостаточно параметров
                            commandHandled = printBackSETResult(false, commandName, pStream);
                        }
                    }

				} // SET COMMAND

				else if (textString.startsWith(CORE_COMMAND_GET)|| textString.startsWith(CORE_COMMAND_GET_M)) // команда на получение свойств
				{
				    const char* commandName = cParser.getArg(2);
                        
                    if (!strcmp_P(commandName, VERSION_COMMAND)||!strcmp_P(commandName, VERSION_COMMAND_M)) // получение версии ПО 
				    {
                        if (cParser.argsCount() > 1)
                        {
                            commandHandled = getVER(pStream);
                        }
                        else
                        {
                            // недостаточно параметров
                            commandHandled = printBackSETResult(false, commandName, pStream);
                        }
				    }
                    else if (!strcmp_P(commandName, GET_FLY)|| !strcmp_P(commandName, GET_FLY_M)) // получение данных из базы самолетов. 
                    {
                        if (cParser.argsCount() > 2)
                        {
                            commandHandled = getFly(pStream); // получение информацию с базы данных
                        }
                        else
                        {
                            // недостаточно параметров
                            commandHandled = printBackSETResult(false, commandName, pStream);
                        }
                    }
                    else if (!strcmp_P(commandName, GET_BASE) || !strcmp_P(commandName, GET_BASE_M)) // получение данных из базы самолетов. 
                    {
                        if (cParser.argsCount() > 2)
                        {
                            commandHandled = getBase(pStream); // получение информацию с базы данных
                        }
                        else
                        {
                            // недостаточно параметров
                            commandHandled = printBackSETResult(false, commandName, pStream);
                        }
                    }

				}// GET COMMAND
			}
			else  // Получить текстовую команду
			{
				commandHandled = setTXT(commandName, cParser, pStream, textString);
			}
        }
    }
 
    if (!commandHandled)
    {
        onUnknownCommand(command, pStream);
    }
}
//--------------------------------------------------------------------------------------------------------------------------------------

void CommandHandlerClass::onUnknownCommand(const String& command, Stream* outStream) // обработчик неизвестной команды
{
    outStream->print(CORE_COMMAND_ANSWER_ERROR);
    outStream->println(F("UNKNOWN COMMAND"));  
}

//--------------------------------------------------------------------------------------------------------------------------------------
bool CommandHandlerClass::getVER(Stream* pStream) // получение версии ПО
{  
    char str_ver[32];
    String ver = service.getVer();
    ver.toCharArray(str_ver, 32);

    pStream->print(CORE_COMMAND_ANSWER_OK);
    pStream->print(CORE_COMMAND_PARAM_DELIMITER);

    //pStream->print(F("FlyRf "));
    pStream->println(str_ver);

    return true;
}

//--------------------------------------------------------------------------------------------------------------------------------------
bool CommandHandlerClass::printBackSETResult(bool isOK, const char* command, Stream* pStream) // печать ответа на команду
{
  if(isOK)
    pStream->print(CORE_COMMAND_ANSWER_OK);
  else
    pStream->print(CORE_COMMAND_ANSWER_ERROR);

  pStream->print(command);
  pStream->print(CORE_COMMAND_PARAM_DELIMITER);

  if(isOK)
    pStream->println(F("OK"));
  else
    pStream->println(F("BAD_PARAMS"));

  return true;
}

int CommandHandlerClass::mb_strlen(char* source, int letter_n) 
{
    int i, k;
    int target = 0;
    unsigned char n;
    char m[2] = { '0', '\0' };
    k = strlen(source);
    i = 0;

    while (i < k) 
    {
        n = source[i]; i++;

