MoseychukA/FLARM_ALL/Base_Lan_ESP32/FlyRf_Lan_26_03_22_00/CoreCommandBuffer.cpp
        if (n >= 0xBF)
        {
            switch (n)
            {
                case 0xD0:
                {
                    n = source[i]; i++;
                    if (n == 0x81) { n = 0xA8; break; }
                    if (n >= 0x90 && n <= 0xBF) n = n + 0x2F;
                    break;
                }
                case 0xD1:
                {
                    n = source[i]; i++;
                    if (n == 0x91) { n = 0xB7; break; }
                    if (n >= 0x80 && n <= 0x8F) n = n + 0x6F;
                    break;
                }
            }
        }
        m[0] = n; target = target + 1;
        if (target == letter_n)
            break;
    }
    return target; // i;
}




//--------------------------------------------------------------------------------------------------------------------------------------
bool CommandHandlerClass::setTXT(const char* commandPassed, CommandParser& parser, Stream* pStream, String textString) // Программа приема текстового сообщения
{
    if (commandPassed)
    {
        /* pStream->print(CORE_COMMAND_ANSWER_OK);
         pStream->print(commandPassed);
         pStream->print(CORE_COMMAND_PARAM_DELIMITER); */

         /* 0) Преобразовать строку
         *  1) получить текущий адрес сообщения.
         *  2) записать признак нового сообщения ("1")
         * 2a) получить номер текущего сообщения
         *  3) Записать номер сообщения (адрес сообщения + 1)
         * 4a) увеличить номер
         *  4) сохранить сообщение не более 160 символов (адрес сообщения + 10)
         *  5) получить количество сообщений
         *  6) увеличить количество сообщений на "1"
         *  7) Сохранить количество сообщений


           Параметры блока записи сообщения в энергонезависимую память
           Под сообщение отведено 120 байт плюс 20 байт для различных флагов
           1 байт - флаг наличия сообщения. "1" - есть новое сообщение, иначе нет
           2 байт - флаг операции прочтения сообщения. "1" новое сообщение прочтено, иначе нет
           3 байт - флаг передачи подтверждения "ОК". "1" подтверждение прочтения передано, иначе нет
           4 байт - порядковый номер сообщения.
           9 - 18 байт - резерв
           19 - 159 отведено под сообщение(4 строки по 20 символов).Максимальное количество сообщений - 99.
             */
             //**************************************************
        const char* Number_from_Message = parser.getArg(0);                  //  Получить текстовую строку номера сообщения Number_from_Message
        String timeString = parser.getArg(2);                                // Получить текстовую строку из сообщения 

        int8_t NumberMessage = atoi(parser.getArg(0));                       // Получить номер сообщения в виде int                

        char msg_tmp[BUFFER_SIZE] = "";                            // Массив для приема текстовых сообщений
        char time_msg_tmp[20] = "";                                // Массив для приема времени текстовых сообщений
        char msg_tmp_bt[BUFFER_SIZE] = "";                         // Массив для отправки текстовых сообщений по Bluetooth

        char msgOK_Trecker[20] = "#";                                         // Формирование строки для ответного сообщения 
        strcat(msgOK_Trecker, Number_from_Message);                          // Добавили в ответ номер ответного сообщения
        pStream->println(msgOK_Trecker);                                     // Передать подтерждение о получении сообщения в треккер

        int minute_all = 0;
        int minute_msg = 0;
        int hour_msg = 0;
        int min_msg = 0;

        if (gnss.time.isValid())
        {
            int hour_tmp = service.get_time_hour();
            int hour_minute = service.get_time_minute();
            minute_all = hour_tmp * 60 + hour_minute;
        }
        else
        {
            minute_all = 10 * 60 + 20;
        }

        if (timeString.length() != 0)
        {
            int index_hour = timeString.indexOf(':');


            if (index_hour != -1)
            {
               // hour_msg = timeString.substring(0, index_hour).toInt();
                String hour_tmp = timeString.substring(0, index_hour);
                hour_msg = hour_tmp.toInt();
                String min_tmp = timeString.substring(index_hour + 1);
               // min_msg = timeString.substring(index_hour + 1).toInt();
                min_msg = min_tmp.toInt();
            }
            strncpy(time_msg_tmp, timeString.c_str(), timeString.length() + 1);  // Преобразование принятую строку c времени, String в массив char для последующей обработки
        }

        // Определить не просрочено ли время прихода сообщения.
        minute_msg = hour_msg * 60 + min_msg;

        strncpy(msg_tmp, textString.c_str(), textString.length() + 1);          // Преобразование принятую строку String в массив char для последующей обработки
        int tmp_msg_len = mb_strlen(msg_tmp, textString.length()+1);

        pStream->println(tmp_msg_len);   // Отправить длину сообщения 
        //pStream->println(minute_all);    // Отправить текущее время в минутах
        //pStream->println(minute_msg);    // Отправить время отправки сообщения 

        if (((minute_all - minute_msg) <= 10 && minute_msg < minute_all) || ((minute_all - minute_msg) == 0))
        {

            if (textString.length() != 0)
            {
                if (tmp_msg_len > 178)  // Проверить максимальную длину сообщения
                {
                    pStream->print(CORE_COMMAND_ANSWER_ERROR);
                    pStream->println(F("The text is very long. !Maximum 178 characters"));
                    msg_tmp[textString.length() + 1] = { 0 };
                    strncpy(msg_tmp, textString.c_str(), 178 + 1);          // Преобразование принятую строку String в массив char для последующей обработки
                }

                if (timeString.length() != 0)
                {
                    strncpy(time_msg_tmp, timeString.c_str(), timeString.length() + 1);  // Преобразование принятую строку c временем, String в массив char для последующей обработки
                    strcat(msg_tmp_all, time_msg_tmp);                                   // Записать в строку время отправки сообщения
                    strcat(msg_tmp_all, " ");                                            // Добавить пробел между временем и сообщением
                    strcat(msg_tmp_all, msg_tmp);                                        // Записать в строку само сообщение
                }

                snprintf_P(msg_tmp_bt, sizeof(msg_tmp_bt),
                    PSTR("$FLYMSG,%s,%s" PFLAA_EXT1_FMT "*"),
                    time_msg_tmp,
                    msg_tmp
                    PFLAA_EXT1_ARGS);

