MoseychukA/FLARM_ALL/Base_Lan_ESP32/FlyRf_Lan_26_03_22_00/CoreCommandBuffer.cpp
                NMEA_add_checksum(msg_tmp_bt, sizeof(msg_tmp_bt) - strlen(msg_tmp_bt));

                NMEA_Out(settings->nmea_out, (byte*)msg_tmp_bt, strlen(msg_tmp_bt), false);

                Commands.clearCommand();
                service.setMessageRead(true);
                service.setNewMessageFlag(true);                                         // Установить флаг нового сообщения. Программа извещена и приступила к обработке нового сообщения.
                service.set_confirm_message(true);                                       // Разрешить отправить подтверждение прочтения сообщения.
            }
        }
        else
        {
            pStream->print(CORE_COMMAND_ANSWER_ERROR);
            pStream->println(F("Incorrect time! Please check the time"));
        }

    }
   return true;
}


bool  CommandHandlerClass::clearMail(const char* commandPassed, CommandParser& parser, Stream* pStream)      // Стереть всю почту
{

    if (parser.argsCount() < 1)
        return false;
    clear_message = true; // Стереть всю почту
    pStream->print(CORE_COMMAND_PARAM_DELIMITER);
    pStream->print(CORE_COMMAND_ANSWER_OK);
    return true;
}


bool CommandHandlerClass::setFly(const char* param)
{
    /*
     Разбираем параметр данных самолета на составные части
     #1#SET#FLY#адрес,squawk,номер рейса,altitude,pressure_altitude,speed,course,vert_rate,latitude,longitude,aircraft_type,hour,minute
    */
    // буфер под промежуточные данные
    char workBuff[13] = { 0 };
    char* writePtr = workBuff;

    fo_msg = EmptyFO;

    const char* delim = strchr(param, ',');  // Определяем первые данные
    if (!delim || (delim - param > 6))
        return false;
    while (param < delim)
        *writePtr++ = *param++;
    *writePtr = 0;
    writePtr = workBuff;
    fo_msg.addr = strtoul(writePtr, NULL, 16); // Извлечение адреса из строки
 
    param = delim + 1;                  // Извлечение squawk из строки
    delim = strchr(param, ',');
    if (!delim || (delim - param > 4))
        return false;
    while (param < delim)
        *writePtr++ = *param++;
    *writePtr = 0;
    writePtr = workBuff;
    fo_msg.squawk = atoi(writePtr);
 
    param = delim + 1;                   // Извлечение номера рейса из строки
    delim = strchr(param, ',');
    if (!delim || (delim - param > 8))
        return false;
    while (param < delim)
        *writePtr++ = *param++;
    *writePtr = 0;
    writePtr = workBuff;
    strncpy(fo_msg.callsign, writePtr, strlen(writePtr));  //strlenПреобразование принятую строку
  
    param = delim + 1;               // Вариант измерения высоты геоид
    delim = strchr(param, ',');
    if (!delim || (delim - param > 8))
        return false;
    while (param < delim)
        *writePtr++ = *param++;
    *writePtr = 0;
    writePtr = workBuff;
    fo_msg.altitude = atof(writePtr);
 
    param = delim + 1;               // Извлечение pressure_altitude из строки
    delim = strchr(param, ',');
    if (!delim || (delim - param > 8))
        return false;

    while (param < delim)
        *writePtr++ = *param++;
    *writePtr = 0;
    writePtr = workBuff;
    fo_msg.pressure_altitude = atof(writePtr);
 
    param = delim + 1;               // Извлечение speed из строки
    delim = strchr(param, ',');
    if (!delim || (delim - param > 6))
        return false;
    while (param < delim)
        *writePtr++ = *param++;
    *writePtr = 0;
    writePtr = workBuff;
    fo_msg.speed = atof(writePtr);
 
    param = delim + 1;               // Извлечение course из строки
    delim = strchr(param, ',');
    if (!delim || (delim - param > 6))
        return false;
    while (param < delim)
        *writePtr++ = *param++;
    *writePtr = 0;
    writePtr = workBuff;
    fo_msg.course = atof(writePtr);
 
    param = delim + 1;               // Извлечение vert_rate из строки
    delim = strchr(param, ',');
    if (!delim || (delim - param > 4))
        return false;
    while (param < delim)
        *writePtr++ = *param++;
    *writePtr = 0;
    writePtr = workBuff;
    fo_msg.vert_rate = atoi(writePtr);
 
    param = delim + 1;               // Извлечение latitude из строки
    delim = strchr(param, ',');
    if (!delim || (delim - param > 10))
        return false;
    while (param < delim)
        *writePtr++ = *param++;
    *writePtr = 0;
    writePtr = workBuff;
    fo_msg.latitude = atof(writePtr);
 
    param = delim + 1;               // Извлечение longitude из строки
    delim = strchr(param, ',');
    if (!delim || (delim - param > 10))
        return false;
    while (param < delim)
        *writePtr++ = *param++;
    *writePtr = 0;
    writePtr = workBuff;
    fo_msg.longitude = atof(writePtr);
 
    param = delim + 1;               // Извлечение aircraft_type из строки
    delim = strchr(param, ',');
    if (!delim || (delim - param > 2))
        return false;
    while (param < delim)
        *writePtr++ = *param++;
    *writePtr = 0;
    writePtr = workBuff;
    fo_msg.aircraft_type = atoi(workBuff);

    param = delim + 1;               // Извлечение часов  из строки
    delim = strchr(param, ',');
    if (!delim || (delim - param > 3))
        return false;
    while (param < delim) 
        *writePtr++ = *param++;
    *writePtr = 0;
    writePtr = workBuff;
    fo_msg.hour_msg = atoi(workBuff);  // Получить часы
 
    param = delim + 1; // перемещаемся на следующий компонент - минута
    while (*param && writePtr < &(workBuff[2]))
        *writePtr++ = *param++;
    *writePtr = 0;
    fo_msg.min_msg = atoi(workBuff);   // Получить минуты

    fo_msg.timestamp = now(); //  
    fo_msg.signal_source = 2;
 
    int minute_all = 0;
    int minute_msg = 0;

    if (gnss.time.isValid())
    {
        minute_all = ((int)gnss.time.hour() * 60) + gnss.time.minute();
    }
    else
    {
        minute_all = (10 * 60) + 20;
    }

    // Определить не просрочено ли время прихода сообщения.
    minute_msg = (fo_msg.hour_msg * 60) + fo_msg.min_msg;

    if ((minute_all - minute_msg) <= 10 && minute_msg < minute_all || (minute_all - minute_msg) == 0)
    {
        // Расчет расстояния, курса и уровня опастности сближения нашего и стороннего самолета
        if (fo_msg.latitude != 0 && fo_msg.longitude != 0) // Расчет возможен если получены координаты нашего и стороннего самолета
        {
            Traffic_Update(&fo_msg);   // Определяем дистанцию и курс стороннего самолета
        }

        // Остальные параметры записываем в базу 
        Traffic_Msg_Add(&fo_msg);
        return true;
    }
    /* Пример строки
    #1#SET#FLY#адрес, squawk, номер рейса, altitude, pressure_altitude, speed, course, vert_rate, latitude, longitude, aircraft_type, hour, minute

    */

