MoseychukA/FLARM_ALL/Base_Lan_ESP32/FlyRf_Lan_26_03_22_00/CoreCommandBuffer.cpp
    return false;
}

bool CommandHandlerClass::Traffic_Msg_Add(ufo_t* fop)
{
    int i;

    for (i = 0; i < MAX_TRACKING_OBJECTS; i++)
    {
        if (Container_msg[i].addr == fo_msg.addr && fo_msg.addr != 0) // Если объект записан - обновить и завершить
        {
            Container_msg[i] = fo_msg;
            return true;
        }
    }

    for (i = 0; i < MAX_TRACKING_OBJECTS; i++)
    {
        if(Container_msg[i].addr == 0)
        {
            Container_msg[i] = fo_msg;
            Container_msg[i].delay_time_msg = 0;
            return true;
        }
    }

    return true;
}

void CommandHandlerClass::SendTraffic_Msg()
{
 
    static uint32_t tmr_msg = millis();

    if (millis() - tmr_msg > 2000)
    {
        tmr_msg = millis();

        for (int i = 0; i < MAX_TRACKING_OBJECTS; i++)
        {
 
            fo.addr = Container_msg[i].addr;
            fo.squawk = Container_msg[i].squawk;
            memcpy((char*)fo.callsign, Container_msg[i].callsign, strlen(Container_msg[i].callsign));
            fo.altitude = Container_msg[i].altitude;
            fo.pressure_altitude = Container_msg[i].pressure_altitude;
            fo.speed = Container_msg[i].speed;
            fo.course = Container_msg[i].course;
            fo.vert_rate = Container_msg[i].vert_rate;
            fo.latitude = Container_msg[i].latitude;
            fo.longitude = Container_msg[i].longitude;
            fo.aircraft_type = Container_msg[i].aircraft_type;
            fo.timestamp = now(); //  
            fo.signal_source = 2;
            fo.hour_msg = Container_msg[i].hour_msg;  // Получить часы
            fo.min_msg = Container_msg[i].min_msg;    // Получить минуты


            // Расчет расстояния, курса и уровня опастности сближения нашего и стороннего самолета
            if (fo.latitude != 0 && fo.longitude != 0) // Расчет возможен если получены координаты нашего и стороннего самолета
            {
                if (service.lockContainer())
                {
                    Traffic_Update(&fo);
                    Traffic_Add(&fo);
                    service.unlockContainer();
                }
            }

           

            if (now() - Container_msg[i].timestamp > MSG_OFF_EXPIRATION_TIME && Container_msg[i].addr != 0) // Удалить данные по самолету через 10 минут
            {
                Container_msg[i] = EmptyFO;
                Container[i] = EmptyFO;
            } 

            if (Container_msg[i].latitude != 0 && Container_msg[i].longitude != 0) // Проверим на всякий случай.
            {
                //int minute_msg_tmp = 0;
                if(Container_msg[i].delay_time_msg == 0) // Первая запись в базу
                { 
     
                    if (gnss.time.isValid()) // Текущее время
                    {
                        hour_gps_tmp_d[i] = (int)gnss.time.hour() * 60;
                        minute_gps_tmp_d[i] = (int)gnss.time.minute();
                        minute_all_d[i] = hour_gps_tmp_d[i] + minute_gps_tmp_d[i]; // Текущее GPS время в минутах
                    }
                    else
                    {
                        minute_all_d[i] = (10 * 60) + 20;             // Текущее тестовое время (10-20) в минутах
                    }

                    // Определить не сколько прошло секунд со времени отправки сообщения.
                    minute_msg_d[i] = (Container_msg[i].hour_msg * 60) + Container_msg[i].min_msg; // Время отправки сообщения в минутах

                    minute_msg_tmp_d[i] = (minute_all_d[i] - minute_msg_d[i]) * 60;   // Разность времени текущего и времени отправки сообщения в секундах
                    Container_msg[i].delay_time_msg = now();                          // Записать в базу стороннего самолета текущее время 
                }
                else
                {
                    minute_msg_tmp_d[i] = 2.0; 
                    Container_msg[i].delay_time_msg = now();
                }
                 
                if (Container_msg[i].speed > 5 && Container_msg[i].altitude > 10)
                {
                    float speed_tmp = (Container_msg[i].speed * 1000) / 3600 * minute_msg_tmp_d[i];
                    test3coordinat(Container_msg[i].latitude, Container_msg[i].longitude, speed_tmp, Container_msg[i].course, i);
                }
            }
        }
    }
}

//====================== Расчет координаты точки при наличии курса и расстояния ================================

void CommandHandlerClass::test3coordinat(float lat1, float lon1, float dist, float brng, uint8_t i_Container)
{
    CurLon   = lon1;   //37.243040;
    CurLat   = lat1;   // 56.097114;
    Bearing  = brng;   // Bearing of travel
    Distance = dist;   // m per update 

    r_CurLon = radians(CurLon);
    r_CurLat = radians(CurLat);
    r_Bearing = radians(Bearing);
    float DestLat = asin(sin(r_CurLat) * cos(Distance / Eradius) + cos(r_CurLat) * sin(Distance / Eradius) * cos(r_Bearing));
    float DestLon = r_CurLon + atan2(sin(r_Bearing) * sin(Distance / Eradius) * cos(r_CurLat), cos(Distance / Eradius) - sin(r_CurLat) * sin(DestLat));

    DestLon = (DestLon + 3 * PI) / (2 * PI);
    int i = DestLon;
    DestLon = (DestLon - i) * (2 * PI) - PI;  // normalise to -180..+180º 
    Container_msg[i_Container].latitude = degrees(DestLat);
    Container_msg[i_Container].longitude = degrees(DestLon);
}

 
//--------------------------------------------------------------------------------------------------------------------------------------
bool CommandHandlerClass::getFly(Stream* pStream) // получение информацию с базы данных
{
    pStream->println(CORE_COMMAND_ANSWER_OK);
    send_ThisAircraft();
    return true;
}

void CommandHandlerClass::send_ThisAircraft()
{
    char FLYBuffer[128];
 
            snprintf_P(FLYBuffer, sizeof(FLYBuffer),
                PSTR("$%06X,%d,%d,%d,%d,%6f,%6f,%d""*"),
                ThisAircraft.addr,                   // Адрес нашего устройства, которому отправлен запрос
                (int)ThisAircraft.altitude,          // Высота геоид (GPS)
                (int)ThisAircraft.pressure_altitude, // Высота по датчику давления
                (int)ThisAircraft.speed,             // Скорость  km/h IAS
                (int)ThisAircraft.course,            // Курс в градусах
                ThisAircraft.latitude,               // Широта
                ThisAircraft.longitude,              // Долгота
                ThisAircraft.aircraft_type           // Тип воздушного судна
             );   
                                                     // *
                                                     // Контрольная сумма пакета
            NMEA_add_checksum(FLYBuffer, sizeof(FLYBuffer) - strlen(FLYBuffer));
            SERIAL_TRACKER.print(FLYBuffer);
 
