MoseychukA/FLARM_ALL/Base_Lan_ESP32/FlyRf_Lan_26_03_22_00/CoreCommandBuffer.cpp
}


//--------------------------------------------------------------------------------------------------------------------------------------
bool CommandHandlerClass::getBase(Stream* pStream) // получение информацию с базы данных
{
    pStream->println(CORE_COMMAND_ANSWER_OK);
    send_base();
    return true;
}

void CommandHandlerClass::send_base()
{
   // char FLYBuffer[128];

    for (int i = 0; i < MAX_TRACKING_OBJECTS; i++)
    {
        if (Container[i].addr)  // Если есть самолет в базе
        {
            char FLYBuffer[128];
            snprintf_P(FLYBuffer, sizeof(FLYBuffer),
                PSTR("$%06X,%d,%8s,%d,%d,%d,%d,%d,%6f,%6f,%d,%d,%d,%d""*"),
                Container[i].addr,                   // Адрес устройства стороннего самолета
                Container[i].squawk,                 // Номер, назначаемый диспетчером для обмена с локатором.
                Container[i].callsign,                 // Номер рейса
                (int)Container[i].altitude,          // Высота геоид (GPS)
                (int)Container[i].pressure_altitude, // Высота по датчику давления
                (int)Container[i].speed,             // Скорость  km/h IAS
                (int)Container[i].course,            // Курс в градусах
                Container[i].vert_rate,              // Скорость подъема или снижения ft/m
                Container[i].latitude,               // Широта
                Container[i].longitude,              // Долгота
                Container[i].aircraft_type,          // Тип воздушного судна
                Container[i].signal_source,          // Источник данных (0-LoRa, 1- DUMP1090, 2 - текстовая строка из GSM или Иридиум)
                Container[i].hour_msg,               // Время час
                Container[i].min_msg                 // Время минуты 
            );                    // 
                                                 // *
                                                 // Контрольная сумма пакета
            NMEA_add_checksum(FLYBuffer, sizeof(FLYBuffer) - strlen(FLYBuffer));
            SERIAL_TRACKER.print(FLYBuffer);
        }
    }

}

bool  CommandHandlerClass::setTRACKER(const char* commandPassed, CommandParser& parser, Stream* pStream)      //
{
    if (parser.argsCount() > 2)
    {
        String GSMCommand;

        GSMCommand = parser.getArg(3);
        pStream->print(CORE_COMMAND_ANSWER_OK);
        pStream->println(GSMCommand);

        if (GSMCommand.equalsIgnoreCase("OFF"))// -возвращает true, если myString совпадает с myString2.Регистр букв неважен
        {
            settings->tracker_send = TRACKER_SEND_OFF;
            delay(1000);
            EEPROM_store();
            RF_Shutdown();
            delay(1000);
            SoC->reset();
        }
        else if (GSMCommand.equalsIgnoreCase("SINGLE"))
        {
            settings->tracker_send = TRACKER_SEND_SINGLE;
            delay(1000);
            EEPROM_store();
            RF_Shutdown();
            delay(1000);
            SoC->reset();
        }
        else if (GSMCommand.equalsIgnoreCase("AUTO"))
        {
            settings->tracker_send = TRACKER_SEND_AUTO;
            delay(1000);
            EEPROM_store();
            RF_Shutdown();
            delay(1000);
            SoC->reset();
        }
        else if (GSMCommand.equalsIgnoreCase("MINI"))
        {
            settings->tracker_send = TRACKER_SEND_MINI;
            delay(1000);
            EEPROM_store();
            RF_Shutdown();
            delay(1000);
            SoC->reset();
        }
        else
        {
            return false;
        }

        return true;
    }

    return false;
}

void CommandHandlerClass::GPS_send_base()
{
    gsm_alien_count = Traffic_Count();
    if ((settings->tracker_send == TRACKER_SEND_AUTO))
    {
        static uint32_t gsm_tmr = millis();
        if (millis() - gsm_tmr > 1000*60)
        {
            gsm_alien_count = Traffic_Count();
            gsm_tmr = millis();
            if (gsm_alien_count != 0)
            {
                send_base();
            }
        }
    }
    else if (settings->tracker_send == TRACKER_SEND_SINGLE)
    {
        if (gsm_alien_count == 0) return;
        if (gsm_alien_count != 0 && gsm_alien_count != gsm_alien_count_old)
        {
            gsm_alien_count_old = gsm_alien_count;
            send_base();
        }
    }

    else if (settings->tracker_send == TRACKER_SEND_MINI)
    {
        if (gsm_alien_count == 0) return;
        for (int i = 0; i < MAX_TRACKING_OBJECTS; i++)
        {
            if ((Container[i].addr != addr_old[i]) && (Container[i].addr != 0) && (Container[i].latitude != 0) && (Container[i].addr != ThisAircraft.addr))
            {
                addr_old[i] = Container[i].addr;
                char FLYBuffer[128];
                snprintf_P(FLYBuffer, sizeof(FLYBuffer),
                    PSTR("$%06X,%d,%8s,%d,%d,%d,%d,%d,%6f,%6f,%d,%d,%d,%d""*"),
                    Container[i].addr,                   // Адрес устройства стороннего самолета
                    Container[i].squawk,                 // Номер, назначаемый диспетчером для обмена с локатором.
                    Container[i].callsign,                 // Номер рейса
                    (int)Container[i].altitude,          // Высота геоид (GPS)
                    (int)Container[i].pressure_altitude, // Высота по датчику давления
                    (int)Container[i].speed,             // Скорость  km/h IAS
                    (int)Container[i].course,            // Курс в градусах
                    Container[i].vert_rate,              // Скорость подъема или снижения ft/m
                    Container[i].latitude,               // Широта
                    Container[i].longitude,              // Долгота
                    Container[i].aircraft_type,          // Тип воздушного судна
                    Container[i].signal_source,          // Источник данных (0-LoRa, 1- DUMP1090, 2 - текстовая строка из GSM или Иридиум)
                    Container[i].hour_msg,               // Время час
                    Container[i].min_msg                 // Время минуты 
                );                    // 
                                                     // *
                                                     // Контрольная сумма пакета
                NMEA_add_checksum(FLYBuffer, sizeof(FLYBuffer) - strlen(FLYBuffer));
                SERIAL_TRACKER.print(FLYBuffer);
            }
            else if (!Container[i].addr)
            {
                addr_old[i] = 0;
            }
        }
    }
}

bool  CommandHandlerClass::setBTOK(const char* commandPassed, CommandParser& parser, Stream* pStream)      //
{
    if (parser.argsCount() > 1)
    {
       // String GSMCommand;
        service.setMessageRead(true);
        return true;
    }
    return false;
}

void CommandHandlerClass::send_reply()   // отправить ответ
{
    char msgOK_Trecker[10] = "|OK";                                               // Формирование строки для ответного сообщения 
    char msgNum[2] = "";                                                          // массив для записи номера ответного сообщения
    char msg_resp[60] = "";                                                       // 
    strcat(msgOK_Trecker, msgNum);                                                // Добавили в "|OK" номер ответного сообщения
    strcat(msg_resp, msgOK_Trecker);                                              // Добавили к текущему ответу новый ответ. Формируем строку с несколькими ответами
    SERIAL_TRACKER.println(msg_resp);                                             // Передать подтерждение о прочтении сообщения в буфер треккера
    Serial.println(msg_resp);
}


// --------------------------------------------------------------------------------------------------------------------------------------
